[{"Key":"fabbdea3-864f-4177-b56d-b993485172ee","Text":"Yalnızca tamsayı değerleri kabul eden bir veri türü."},{"Key":"0deb75b6-3231-43a4-8d09-37579a0e5155","Text":"Mantıksal değerleri kabul eden bir veri türü."},{"Key":"57c1c8e0-f5ef-463b-818e-2e12c1692c61","Text":"Bir metin dizesini saklamak için hangi veri türü kullanılır?"},{"Key":"94c4666c-f268-4f69-b997-c7f787e629c8","Text":"İki değerin eşitliğini test etmek için hangi operatör kullanılır?"},{"Key":"67b3116e-0bd4-4019-8b04-c3f4e32a5171","Text":"Konsola veri çıktısı vermek için hangi yöntem kullanılır?"},{"Key":"c5eb7e32-216b-4832-beb6-ba0ef2136699","Text":" Bir sınıfın örneğini oluşturmak için hangi anahtar sözcük kullanılır?"},{"Key":"cfd89209-9763-44cc-8a0a-5bdbe117aa5f","Text":"Hangi erişim değiştiricisi bir alana yalnızca bir sınıf içinde erişime izin verir?"},{"Key":"d5676c0f-565d-4a18-bfd4-623f955c467a","Text":"Bir sınıfın nesnesi oluşturulduğunda çağrılan özel yöntemin adı nedir?"},{"Key":"73183595-04a3-4da1-bf5a-30e54d8c58b8","Text":"Bir koşulun doğru olması halinde bir kod bloğunu çalıştıran yapıya ne ad verilir?"},{"Key":"31faa94f-db4a-486c-b246-8de19f75f27e","Text":"Bir döngüden çıkmak için hangi anahtar sözcük kullanılır?"},{"Key":"81bec09f-5a68-4719-8d7f-56df021fbc15","Text":"İstisnaları işlemek için hangi anahtar sözcük kullanılır?"},{"Key":"b48b09aa-6e27-4629-b6c1-c8df5501f1ab","Text":"Hangi arayüz bir eleman koleksiyonu üzerinde yineleme sağlar?"},{"Key":"903342d1-5053-4dcb-bfac-f7887f33327d","Text":"Soyut bir sınıf oluşturmak için hangi anahtar sözcük kullanılır?"},{"Key":"b97783f8-c687-47e9-b6de-e31fc4c4842e","Text":"Bir öğe listesini artan sırada sıralamak için hangi yöntem kullanılır?"},{"Key":"1e085717-9ddb-46e0-aa97-630c70dc64bb","Text":"Hangi operatör bir koşulu test etmenizi ve sonucuna bağlı olarak bir değer döndürmenizi sağlar?"},{"Key":"9c974e6b-1e75-4523-9f26-17dcc2535e05","Text":"Python'da tamsayılar için hangi veri türü kullanılır?"},{"Key":"f2e114f3-cb08-4350-bad7-72e81d76a408","Text":"Hangi veri türü mantıksal değerleri depolar?"},{"Key":"427006d4-591e-41fc-b4c1-72e50c964e50","Text":"Verileri ekranda görüntülemek için hangi yerleşik yöntem kullanılır?"},{"Key":"ed93d50c-1403-4135-9947-679cfcdad4dd","Text":"Bir metin dizesini temsil eden veri türünün adı nedir?"},{"Key":"25a524b8-c72a-48d4-b27b-19843f1c302b","Text":"Bir değişkene değer atamak için hangi operatör kullanılır?"},{"Key":"23baf28e-d9ec-44f8-bcbf-1f735b1b3297","Text":"İki değerin eşitliğini kontrol eden operatörün adı nedir?"},{"Key":"2b602564-dc71-4e1b-965e-d3f4c90dcff4","Text":"Bir fonksiyon oluşturmak için hangi anahtar sözcük kullanılır?"},{"Key":"3fd0930a-eef2-4840-befa-0e8eabd9c8f3","Text":"İstisna işleme için kullanılan yapının adı nedir?"},{"Key":"c351b807-1e7c-427a-94a1-8dca0ca305f1","Text":"Hangi liste yöntemi listedeki eleman sayısını döndürür?"},{"Key":"e341ce5a-79e5-423d-ac20-177187a6d7fb","Text":"Kütüphaneleri içe aktarmak için hangi anahtar kelime kullanılır?"},{"Key":"f9945fd2-33bc-4b49-8124-f04fc226cf7e","Text":"Bir sınıfı tanımlamak için hangi anahtar sözcük kullanılır?"},{"Key":"eba19fae-3cd8-41f3-9f02-fc2a696032fb","Text":"Hangi operatör bir elemanın bir koleksiyona ait olup olmadığını kontrol eder?"},{"Key":"71873b53-2c99-42f6-bfe2-0efa02f0b4e9","Text":"Hangi liste yöntemi listenin sonuna bir öğe ekler?"},{"Key":"4863dc95-e81c-453e-b87b-9a1eb48de050","Text":"Aynı anda birden fazla koşulu kontrol etmek için hangi operatör kullanılır?"},{"Key":"3104827f-91c9-48d4-bac6-43fd17057a89","Text":"Bir tablodan veri seçmek için hangi anahtar kelime kullanılır?"},{"Key":"38ac5464-b27b-485e-aa18-b96b298f9e55","Text":"Bir tabloya yeni veri eklemek için hangi anahtar sözcük kullanılır?"},{"Key":"1d19860e-017e-4db2-99af-25264ecc39f4","Text":"Bir tablodaki mevcut verileri değiştirmek için hangi anahtar sözcük kullanılır?"},{"Key":"0c192094-069b-43d3-9020-b0e7e7d4b5aa","Text":"Bir tablodan veri kaldırmak için hangi anahtar sözcük kullanılır?"},{"Key":"b256c196-03dd-4f2a-9f7c-b505cc27b972","Text":"Bir sorgunun sonucunu sıralamak için hangi anahtar kelime kullanılır?"},{"Key":"8b7010a4-75ae-4aff-88fc-1c7581613c7e","Text":"Bir sorguda satırları filtrelemek için hangi anahtar sözcük kullanılır?"},{"Key":"bdc46107-101e-42bf-a161-97da0011cc08","Text":"İki tabloyu ortak bir alana göre birleştirmek için hangi anahtar sözcük kullanılır?"},{"Key":"27fa812f-21ec-4712-8a3d-6fead8a2a759","Text":"Bir alanın benzersiz değerini ayarlamak için hangi anahtar kelime kullanılır?"},{"Key":"c21c30b5-478f-4a35-b2bf-f8139f8cd574","Text":"Bir sorguda benzersiz değerler döndürmek için hangi anahtar sözcük kullanılır?"},{"Key":"dc4a9d5a-2000-46ed-aaf3-cd1067466715","Text":"Bir değer aralığı arasındaki bir koşulu test etmek için hangi operatör kullanılır?"},{"Key":"158f8b24-524e-4e0d-9443-054733fa084e","Text":"Yeni bir tablo oluşturmak için hangi anahtar sözcük kullanılır?"},{"Key":"74213b04-197e-45d5-82e6-6684bea423cc","Text":"Bir dizede örüntü bulmak için hangi operatör kullanılır?"},{"Key":"8ba07e26-288c-4409-a14d-54768d3c0b1c","Text":"Satırları ortak bir değere göre gruplamak için hangi anahtar sözcük kullanılır?"},{"Key":"740362f4-3e14-4010-8738-355750e272ad","Text":"NULL değeri kontrol etmek için hangi operatör kullanılır?"},{"Key":"38fe7e80-4521-4334-9fd5-ec515e966511","Text":"Döndürülen dizelerin sayısını sınırlamak için hangi anahtar sözcük kullanılır?"},{"Key":"d7098de9-7666-4899-82eb-3d22979aed11","Text":"Verileri ekranda görüntülemek için hangi operatör kullanılır?"},{"Key":"2004873f-8b88-496d-89f2-ab7e918a71be","Text":"PHP'de değerlerin eşitliğini kontrol etmek için hangi operatör kullanılır?"},{"Key":"f06bb9c3-4dd7-4b3c-837a-8e558e6ddf5c","Text":"POST yöntemini kullanan bir formdan gelen verileri depolayan süper global dizinin adı nedir?"},{"Key":"7dead291-761b-498b-a3d1-02fe8faa6b9a","Text":"Başka bir dosyayı dahil etmek için hangi anahtar sözcük kullanılır?"},{"Key":"0d764b30-71d2-4f6d-84c7-1548961ec616","Text":"Bir komut dosyasının yürütülmesini sonlandırmak için hangi anahtar sözcük kullanılır?"},{"Key":"5d1acb29-576b-4e2e-b9a7-65eeb4b7ad5a","Text":"Oturumları işlemek için kullanılan süper küresel dizinin adı nedir?"},{"Key":"5db09b54-a2c2-4e4b-9802-42e53e2dd3cf","Text":"Bir sabiti tanımlamak için hangi anahtar sözcük kullanılır?"},{"Key":"8198764d-b4d1-4c02-b9ef-9a822aafdda5","Text":"Bir sınıf oluşturmak için hangi anahtar sözcük kullanılır?"},{"Key":"ae946f95-a7b1-46e7-adcd-316b8bf0ac39","Text":"Dizeleri birleştirmek için hangi operatör kullanılır?"},{"Key":"36fb5910-4d24-41cf-94f9-d9a013d06a4f","Text":"Sınıf nesneleri oluşturmak için hangi anahtar sözcük kullanılır?"},{"Key":"eef2f3c5-ab59-4ef5-bdf1-10612a437c0f","Text":"Bir dosyanın varlığını doğrulamak için hangi yöntem kullanılır?"},{"Key":"a632565d-ef95-4199-8b79-d334fa923dc3","Text":"Bir fonksiyondan değer döndürmek için hangi anahtar sözcük kullanılır?"},{"Key":"bdfe0844-304a-43a8-9145-f2bf2c50c0d2","Text":"Bir değişkeni bildirmek için hangi anahtar sözcük kullanılır?"},{"Key":"a2c7599f-6f6c-4b5f-9175-520b7b66a805","Text":"Konsola veri çıktısı vermek için hangi anahtar sözcük kullanılır?"},{"Key":"d8bce1cc-0067-4260-8f12-50697da1291e","Text":"Kesin eşitliği doğrulamak için hangi operatör kullanılır?"},{"Key":"29f2cab5-6ff2-43d7-afc4-a166f1c3dd31","Text":"JavaScript'te dizeler için veri türünün adı nedir?"},{"Key":"03589dcf-0edb-47bb-958a-e1d32cfc7abf","Text":"Bir sabiti bildirmek için hangi anahtar sözcük kullanılır?"},{"Key":"f1f50e1c-1cde-492c-9a01-cb5fe4550ad4","Text":"Dizilerle çalışmak için kullanılan yerleşik nesnenin adı nedir?"},{"Key":"df31973b-3197-4611-ba16-32041c7cb7cb","Text":"Hangi dizi yöntemi dizinin sonuna bir eleman ekler?"},{"Key":"2f0d5a83-6f2a-4c09-a34f-f6b8326d8f0e","Text":"Bir yapıdaki bir koşulu test etmek için hangi anahtar kelime kullanılır?"},{"Key":"54402429-b098-46c5-9264-a1466728fdd4","Text":"Bir dizeyi sayıya dönüştürmek için hangi yöntem kullanılır?"},{"Key":"db1d5ebb-ae96-4ea5-bbea-fb0913d8bcb9","Text":"Fonksiyonların asenkron yürütülmesi için hangi anahtar kelime kullanılır?"}]